isi-ies-group/Window_Control/STM32_wifi/STM32Workspace/ST67W6X_HTTP_Server/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    main.h
  * @author  ST67 Application Team
  * @brief   Header for main.c file.
  *          This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025-2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Horizontal_ENABLE_Pin GPIO_PIN_3
#define Horizontal_ENABLE_GPIO_Port GPIOA
#define SPI_CLK_Pin GPIO_PIN_5
#define SPI_CLK_GPIO_Port GPIOA
#define SPI_MISO_Pin GPIO_PIN_6
#define SPI_MISO_GPIO_Port GPIOA
#define SPI_MOSI_Pin GPIO_PIN_7
#define SPI_MOSI_GPIO_Port GPIOA
#define YLY_Pin GPIO_PIN_1
#define YLY_GPIO_Port GPIOB
#define YLY_EXTI_IRQn EXTI1_IRQn
#define YLE_Pin GPIO_PIN_2
#define YLE_GPIO_Port GPIOB
#define YLE_EXTI_IRQn EXTI2_IRQn
#define Vertical_ENABLE_Pin GPIO_PIN_11
#define Vertical_ENABLE_GPIO_Port GPIOF
#define USER_BUTTON_Pin GPIO_PIN_12
#define USER_BUTTON_GPIO_Port GPIOF
#define BOOT_Pin GPIO_PIN_9
#define BOOT_GPIO_Port GPIOE
#define ZL_A_DIR_Pin GPIO_PIN_10
#define ZL_A_DIR_GPIO_Port GPIOE
#define CHIP_EN_Pin GPIO_PIN_11
#define CHIP_EN_GPIO_Port GPIOE
#define SPI_RDY_Pin GPIO_PIN_13
#define SPI_RDY_GPIO_Port GPIOE
#define SPI_RDY_EXTI_IRQn EXTI13_IRQn
#define ZL_Pin GPIO_PIN_14
#define ZL_GPIO_Port GPIOB
#define ZL_EXTI_IRQn EXTI14_IRQn
#define ZR_Pin GPIO_PIN_15
#define ZR_GPIO_Port GPIOB
#define ZR_EXTI_IRQn EXTI15_IRQn
#define MXLE_Y_DIR_Pin GPIO_PIN_10
#define MXLE_Y_DIR_GPIO_Port GPIOD
#define ZL_A_STEP_Pin GPIO_PIN_11
#define ZL_A_STEP_GPIO_Port GPIOD
#define ZR_Z_DIR_Pin GPIO_PIN_12
#define ZR_Z_DIR_GPIO_Port GPIOD
#define ZR_Z_STEP_Pin GPIO_PIN_13
#define ZR_Z_STEP_GPIO_Port GPIOD
#define SPI_CS_Pin GPIO_PIN_14
#define SPI_CS_GPIO_Port GPIOD
#define LED_RED_Pin GPIO_PIN_2
#define LED_RED_GPIO_Port GPIOG
#define MXRE_A_DIR_Pin GPIO_PIN_4
#define MXRE_A_DIR_GPIO_Port GPIOG
#define MXRI_Z_STEP_Pin GPIO_PIN_5
#define MXRI_Z_STEP_GPIO_Port GPIOG
#define MXRE_A_STEP_Pin GPIO_PIN_6
#define MXRE_A_STEP_GPIO_Port GPIOG
#define MXRI_Z_DIR_Pin GPIO_PIN_7
#define MXRI_Z_DIR_GPIO_Port GPIOG
#define MXLE_Y_STEP_Pin GPIO_PIN_8
#define MXLE_Y_STEP_GPIO_Port GPIOG
#define LED_GREEN_Pin GPIO_PIN_7
#define LED_GREEN_GPIO_Port GPIOC
#define USART1_TX_Pin GPIO_PIN_9
#define USART1_TX_GPIO_Port GPIOA
#define USART1_RX_Pin GPIO_PIN_10
#define USART1_RX_GPIO_Port GPIOA
#define MXLI_X_DIR_Pin GPIO_PIN_14
#define MXLI_X_DIR_GPIO_Port GPIOG
#define YRE_Pin GPIO_PIN_4
#define YRE_GPIO_Port GPIOB
#define YRE_EXTI_IRQn EXTI4_IRQn
#define YRI_Pin GPIO_PIN_5
#define YRI_GPIO_Port GPIOB
#define YRI_EXTI_IRQn EXTI5_IRQn
#define LED_BLUE_Pin GPIO_PIN_7
#define LED_BLUE_GPIO_Port GPIOB
#define MXLI_X_STEP_Pin GPIO_PIN_0
#define MXLI_X_STEP_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */
#ifndef SPI_RDY_Pin
#define SPI_RDY_Pin GPIO_PIN_13
#define SPI_RDY_GPIO_Port GPIOE
#endif

#ifndef SPI_RDY_EXTI_IRQn
#define SPI_RDY_EXTI_IRQn EXTI13_IRQn
#endif

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
